#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
#### Terraform Apply 📖`success`

<details><summary>Show Details</summary>

```terraform
module.yc-vpc.data.yandex_client_config.client: Reading...
module.yc-vpc.data.yandex_client_config.client: Read complete after 0s [id=1878154548]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.yc-vpc.yandex_vpc_default_security_group.default_sg[0] will be created
  + resource "yandex_vpc_default_security_group" "default_sg" {
      + created_at  = (known after apply)
      + description = "Default security group"
      + folder_id   = "b1gsjjo950i2c5fs82pe"
      + id          = (known after apply)
      + labels      = {
          + "created_by" = "terraform-yc-module"
        }
      + name        = (known after apply)
      + network_id  = (known after apply)
      + status      = (known after apply)

      + egress {
          + description       = "To the Internet"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }

      + ingress {
          + description       = "Communication inside this SG"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + predefined_target = "self_security_group"
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + description       = "ICMP"
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ICMP"
          + to_port           = 65535
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
      + ingress {
          + description       = "NLB health check"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + predefined_target = "loadbalancer_healthchecks"
          + protocol          = "TCP"
          + to_port           = -1
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + description       = "RDP"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = 3389
          + protocol          = "TCP"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
      + ingress {
          + description       = "ssh"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = 22
          + protocol          = "TCP"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
    }

  # module.yc-vpc.yandex_vpc_gateway.egress_gateway[0] will be created
  + resource "yandex_vpc_gateway" "egress_gateway" {
      + created_at = (known after apply)
      + folder_id  = "b1gsjjo950i2c5fs82pe"
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "test-module-network-egress-gateway"

      + shared_egress_gateway {}
    }

  # module.yc-vpc.yandex_vpc_network.this[0] will be created
  + resource "yandex_vpc_network" "this" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + description               = "Test network created with module"
      + folder_id                 = "b1gsjjo950i2c5fs82pe"
      + id                        = (known after apply)
      + labels                    = {
          + "created_by" = "terraform-yc-module"
        }
      + name                      = "test-module-network"
      + subnet_ids                = (known after apply)
    }

  # module.yc-vpc.yandex_vpc_route_table.private[0] will be created
  + resource "yandex_vpc_route_table" "private" {
      + created_at = (known after apply)
      + folder_id  = "b1gsjjo950i2c5fs82pe"
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "test-module-network-private"
      + network_id = (known after apply)

      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.yc-vpc.yandex_vpc_route_table.public[0] will be created
  + resource "yandex_vpc_route_table" "public" {
      + created_at = (known after apply)
      + folder_id  = "b1gsjjo950i2c5fs82pe"
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "test-module-network-public"
      + network_id = (known after apply)
    }

  # module.yc-vpc.yandex_vpc_subnet.private["10.10.0.0/24"] will be created
  + resource "yandex_vpc_subnet" "private" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = {
          + "created_by" = "terraform-yc-module"
        }
      + name           = "subnet"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "10.10.0.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"

      + dhcp_options {
          + domain_name         = "internal."
          + domain_name_servers = []
          + ntp_servers         = []
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_subnets = {
      + "10.10.0.0/24" = {
          + folder_id      = (known after apply)
          + name           = "subnet"
          + subnet_id      = (known after apply)
          + v4_cidr_blocks = [
              + "10.10.0.0/24",
            ]
          + zone           = "ru-central1-b"
        }
    }
  + public_subnets  = {}
  + vpc_id          = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
module.yc-vpc.data.yandex_client_config.client: Reading...
module.yc-vpc.data.yandex_client_config.client: Read complete after 0s [id=1878154548]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.yc-vpc.yandex_vpc_default_security_group.default_sg[0] will be created
  + resource "yandex_vpc_default_security_group" "default_sg" {
      + created_at  = (known after apply)
      + description = "Default security group"
      + folder_id   = "b1gsjjo950i2c5fs82pe"
      + id          = (known after apply)
      + labels      = {
          + "created_by" = "terraform-yc-module"
        }
      + name        = (known after apply)
      + network_id  = (known after apply)
      + status      = (known after apply)

      + egress {
          + description       = "To the Internet"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }

      + ingress {
          + description       = "Communication inside this SG"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + predefined_target = "self_security_group"
          + protocol          = "ANY"
          + to_port           = -1
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + description       = "ICMP"
          + from_port         = 0
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + protocol          = "ICMP"
          + to_port           = 65535
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
      + ingress {
          + description       = "NLB health check"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = -1
          + predefined_target = "loadbalancer_healthchecks"
          + protocol          = "TCP"
          + to_port           = -1
          + v4_cidr_blocks    = []
          + v6_cidr_blocks    = []
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + description       = "RDP"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = 3389
          + protocol          = "TCP"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
      + ingress {
          + description       = "ssh"
          + from_port         = -1
          + id                = (known after apply)
          + labels            = (known after apply)
          + port              = 22
          + protocol          = "TCP"
          + to_port           = -1
          + v4_cidr_blocks    = [
              + "0.0.0.0/0",
            ]
          + v6_cidr_blocks    = []
            # (2 unchanged attributes hidden)
        }
    }

  # module.yc-vpc.yandex_vpc_gateway.egress_gateway[0] will be created
  + resource "yandex_vpc_gateway" "egress_gateway" {
      + created_at = (known after apply)
      + folder_id  = "b1gsjjo950i2c5fs82pe"
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "test-module-network-egress-gateway"

      + shared_egress_gateway {}
    }

  # module.yc-vpc.yandex_vpc_network.this[0] will be created
  + resource "yandex_vpc_network" "this" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + description               = "Test network created with module"
      + folder_id                 = "b1gsjjo950i2c5fs82pe"
      + id                        = (known after apply)
      + labels                    = {
          + "created_by" = "terraform-yc-module"
        }
      + name                      = "test-module-network"
      + subnet_ids                = (known after apply)
    }

  # module.yc-vpc.yandex_vpc_route_table.private[0] will be created
  + resource "yandex_vpc_route_table" "private" {
      + created_at = (known after apply)
      + folder_id  = "b1gsjjo950i2c5fs82pe"
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "test-module-network-private"
      + network_id = (known after apply)

      + static_route {
          + destination_prefix = "0.0.0.0/0"
          + gateway_id         = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.yc-vpc.yandex_vpc_route_table.public[0] will be created
  + resource "yandex_vpc_route_table" "public" {
      + created_at = (known after apply)
      + folder_id  = "b1gsjjo950i2c5fs82pe"
      + id         = (known after apply)
      + labels     = (known after apply)
      + name       = "test-module-network-public"
      + network_id = (known after apply)
    }

  # module.yc-vpc.yandex_vpc_subnet.private["10.10.0.0/24"] will be created
  + resource "yandex_vpc_subnet" "private" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = {
          + "created_by" = "terraform-yc-module"
        }
      + name           = "subnet"
      + network_id     = (known after apply)
      + route_table_id = (known after apply)
      + v4_cidr_blocks = [
          + "10.10.0.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"

      + dhcp_options {
          + domain_name         = "internal."
          + domain_name_servers = []
          + ntp_servers         = []
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_subnets = {
      + "10.10.0.0/24" = {
          + folder_id      = (known after apply)
          + name           = "subnet"
          + subnet_id      = (known after apply)
          + v4_cidr_blocks = [
              + "10.10.0.0/24",
            ]
          + zone           = "ru-central1-b"
        }
    }
  + public_subnets  = {}
  + vpc_id          = (known after apply)
module.yc-vpc.yandex_vpc_network.this[0]: Creating...
module.yc-vpc.yandex_vpc_gateway.egress_gateway[0]: Creating...
module.yc-vpc.yandex_vpc_gateway.egress_gateway[0]: Creation complete after 2s [id=enpkq15rtfu2t0tghvtq]
module.yc-vpc.yandex_vpc_network.this[0]: Creation complete after 3s [id=enprc44ml6lbr0llquji]
module.yc-vpc.yandex_vpc_route_table.public[0]: Creating...
module.yc-vpc.yandex_vpc_route_table.private[0]: Creating...
module.yc-vpc.yandex_vpc_default_security_group.default_sg[0]: Creating...
module.yc-vpc.yandex_vpc_route_table.private[0]: Creation complete after 1s [id=enpj17760dpbh5vkdrjt]
module.yc-vpc.yandex_vpc_subnet.private["10.10.0.0/24"]: Creating...
module.yc-vpc.yandex_vpc_default_security_group.default_sg[0]: Creation complete after 1s [id=enpgf0ud2meqmknmlq4o]
module.yc-vpc.yandex_vpc_subnet.private["10.10.0.0/24"]: Creation complete after 1s [id=e2l92nq38a03elos9jon]
module.yc-vpc.yandex_vpc_route_table.public[0]: Creation complete after 3s [id=enpdn7pbm8e30hmjqs3a]

Apply complete! Resources: 6 added, 0 changed, 0 destroyed.

Outputs:

private_subnets = {
  "10.10.0.0/24" = {
    "folder_id" = "b1gsjjo950i2c5fs82pe"
    "name" = "subnet"
    "subnet_id" = "e2l92nq38a03elos9jon"
    "v4_cidr_blocks" = tolist([
      "10.10.0.0/24",
    ])
    "zone" = "ru-central1-b"
  }
}
public_subnets = {}
vpc_id = "enprc44ml6lbr0llquji"
```

</details>

Results for commit: 0be3e8a78705c15e2f78ac2e45a5edb879248543

*Pusher: @ptishkin, Action: `pull_request`, Working Directory: `vpc`, Workflow: `Terraform CI/CD`*